[
  {
    "name": "Collaboration and Culture",
    "description": "A strong DevOps culture, based on collaboration, leadership support, and continuous improvement, is foundational to achieving high performance.",
    "subDimensions": [
      {
        "name": "Cross-functional Collaboration",
        "description": "Encouraging seamless cooperation between Dev, Ops, and Security to eliminate silos.",
        "improves": ["Change Failure Rate", "Time to Restore Service"],
        "levels": [
          "Teams work in silos with limited visibility into each other’s work.",
          "Basic cross-team communication, but misalignment persists.",
          "Regular joint planning sessions and shared objectives improve collaboration.",
          "Dev, Ops, and Security fully integrate workflows and shared responsibilities.",
          "Teams work as autonomous, product-aligned units with strong collaboration."
        ]
      },
      {
        "name": "Blameless Postmortems & Psychological Safety",
        "description": "Encouraging learning from failures instead of assigning blame to foster a safe environment for experimentation.",
        "improves": ["Change Failure Rate", "Time to Restore Service"],
        "levels": [
          "Failures result in blame, discouraging innovation and risk-taking.",
          "Basic postmortems occur but focus on individual accountability.",
          "Structured postmortems identify systemic issues and improvement actions.",
          "Blameless culture enables rapid learning and experimentation.",
          "Continuous feedback loops and psychological safety drive innovation."
        ]
      },
      {
        "name": "Leadership Buy-in & Sponsorship",
        "description": "Executive and management support for DevOps adoption and continuous improvement.",
        "improves": ["Deployment Frequency", "Lead Time for Changes"],
        "levels": [
          "Leaders are unaware or indifferent to DevOps transformation.",
          "Leadership acknowledges DevOps but provides limited resources.",
          "Leaders actively invest in DevOps and drive cultural change.",
          "Executives ensure DevOps principles are part of business strategy.",
          "Leadership continuously funds, promotes, and measures DevOps success."
        ]
      }
    ]
  },
  {
    "name": "Technical Practices & Automation",
    "description": "Automation and modern development practices enable faster, more reliable software delivery.",
    "subDimensions": [
      {
        "name": "Trunk-Based Development",
        "description": "Developers integrate code into a shared repository frequently to reduce merge conflicts.",
        "improves": ["Deployment Frequency", "Lead Time for Changes"],
        "levels": [
          "Long-lived feature branches create bottlenecks.",
          "Developers integrate changes weekly or longer, causing delays.",
          "Daily integrations reduce conflicts and speed up reviews.",
          "Frequent merges and feature flags allow continuous delivery.",
          "Trunk-based development with automated testing enables rapid releases."
        ]
      },
      {
        "name": "Automated Testing",
        "description": "Automating tests at multiple levels (unit, integration, performance) to ensure stability.",
        "improves": ["Change Failure Rate", "Lead Time for Changes"],
        "levels": [
          "Most testing is manual, causing slow releases.",
          "Some unit tests are automated, but coverage is low.",
          "Automated testing is integrated into CI/CD pipelines.",
          "Security, performance, and compliance tests run automatically.",
          "AI-driven testing predicts failures before deployment."
        ]
      },
      {
        "name": "Continuous Integration and Deployment (CI/CD)",
        "description": "Automating build, test, and deployment pipelines to enable fast, frequent releases.",
        "improves": ["Deployment Frequency", "Lead Time for Changes"],
        "levels": [
          "Manual builds and deployments introduce delays.",
          "Some automation exists, but processes are inconsistent.",
          "CI/CD pipelines automate testing and deployments.",
          "Progressive delivery methods (canary, feature flags) are implemented.",
          "Autonomous CI/CD pipelines enable frequent, low-risk releases."
        ]
      }
    ]
  },
  {
    "name": "Reliability & Operational Excellence",
    "description": "Building resilient, self-healing infrastructure and proactive monitoring practices.",
    "subDimensions": [
      {
        "name": "Observability & Monitoring",
        "description": "Real-time insights into system health, logs, and performance metrics.",
        "improves": ["Time to Restore Service", "Change Failure Rate"],
        "levels": [
          "Minimal logging; issues are identified reactively.",
          "Basic monitoring tools provide alerts but lack visibility.",
          "Centralized logging and structured incident tracking improve response times.",
          "Distributed tracing enables deep system insights and proactive detection.",
          "AI-driven observability detects anomalies and prevents failures."
        ]
      },
      {
        "name": "Incident Response & Remediation",
        "description": "Developing automated incident response mechanisms to recover quickly from failures.",
        "improves": ["Time to Restore Service", "Change Failure Rate"],
        "levels": [
          "No structured incident response process exists.",
          "Teams manually track and resolve incidents reactively.",
          "Incident response is automated, reducing recovery times.",
          "Self-healing systems detect and correct failures autonomously.",
          "AI-driven remediation prevents failures before they impact users."
        ]
      }
    ]
  },
  {
    "name": "Security & Compliance",
    "description": "Integrating security into the software development lifecycle without slowing down delivery.",
    "subDimensions": [
      {
        "name": "Shift-Left Security",
        "description": "Incorporating security checks early in the development process.",
        "improves": ["Change Failure Rate", "Lead Time for Changes"],
        "levels": [
          "Security is checked manually after development.",
          "Some automated security scans exist but are not mandatory.",
          "Security testing is fully integrated into CI/CD pipelines.",
          "Automated compliance checks and risk scoring improve security posture.",
          "AI-driven threat modeling proactively prevents vulnerabilities."
        ]
      },
      {
        "name": "Secure Software Supply Chain",
        "description": "Protecting dependencies and ensuring software integrity from development to deployment.",
        "improves": ["Change Failure Rate", "Time to Restore Service"],
        "levels": [
          "Third-party dependencies are not tracked for security risks.",
          "Basic dependency scanning is in place but lacks enforcement.",
          "Dependencies are validated and monitored for vulnerabilities.",
          "End-to-end supply chain security prevents unauthorized modifications.",
          "Self-healing supply chains prevent security breaches in real-time."
        ]
      }
    ]
  }
]
