[
  {
    "name": "Collaboration and Culture",
    "subDimensions": [
      {
        "name": "Cross-functional Collaboration",
        "levels": [
          "Teams are forming initial DevOps connections but work independently.",
          "Basic cross-team discussions occur, with limited collaboration.",
          "Regular standups, retrospectives, and shared decision-making improve alignment.",
          "Dev, Ops, and Security work together seamlessly with shared ownership.",
          "Fully autonomous, product-aligned teams drive innovation and own delivery end-to-end."
        ]
      },
      {
        "name": "Shared Responsibility & Ownership",
        "levels": [
          "Teams operate in silos, with little shared accountability.",
          "Some shared tools exist, but workflows remain separate.",
          "Teams co-own deployment and incident response.",
          "Full accountability for deployments, operations, and reliability.",
          "“You Build It, You Run It” culture is fully adopted across the organisation."
        ]
      },
      {
        "name": "Leadership Buy-in & Sponsorship",
        "levels": [
          "Leadership is unaware or disengaged from DevOps transformation.",
          "Leaders acknowledge DevOps benefits but provide limited support.",
          "Leadership invests in DevOps teams, tooling, and skills development.",
          "Executives actively drive DevOps principles across departments.",
          "DevOps is embedded in the organisation’s strategic vision and leadership mindset."
        ]
      },
      {
        "name": "Blameless Postmortems & Psychological Safety",
        "levels": [
          "No structured postmortems; failures lead to blame culture.",
          "Some postmortems occur, but teams hesitate to openly discuss failures.",
          "Regular postmortems with actionable takeaways promote learning.",
          "Blameless postmortems drive continuous improvement across teams.",
          "Teams proactively learn from incidents in a psychologically safe environment."
        ]
      }
    ]
  },
  {
    "name": "Processes and Practices",
    "subDimensions": [
      {
        "name": "Change Management & Governance",
        "levels": [
          "Changes are manually reviewed, leading to long approval times.",
          "Basic automated approvals exist, but governance remains manual.",
          "Standardised governance with risk-based automated approvals.",
          "Self-service governance allows teams to manage their own deployments.",
          "AI-driven governance optimises risk management and decision-making."
        ]
      },
      {
        "name": "Incident Response & Resilience Engineering",
        "levels": [
          "No formal incident response plan, reliance on ad-hoc fixes.",
          "Teams manually track incidents and root causes.",
          "Incident response playbooks and testing improve reliability.",
          "Automated alerts and proactive monitoring enable fast recovery.",
          "AI-driven, self-healing infrastructure resolves incidents without manual intervention."
        ]
      },
      {
        "name": "Lean Product Management & Flow Efficiency",
        "levels": [
          "Large batch releases and waterfall-style planning dominate workflows.",
          "Smaller batches are introduced, but process bottlenecks remain.",
          "Continuous delivery pipelines improve feedback loops and release cadence.",
          "Value stream mapping and lean principles reduce delays.",
          "Workflows are fully optimised for rapid and iterative delivery."
        ]
      }
    ]
  },
  {
    "name": "Automation",
    "subDimensions": [
      {
        "name": "Infrastructure as Code (IaC)",
        "levels": [
          "Infrastructure is manually configured and deployed.",
          "Some scripting exists, but automation is inconsistent.",
          "Infrastructure is fully managed via version-controlled code.",
          "Immutable infrastructure ensures repeatable, consistent deployments.",
          "AI-driven self-healing infrastructure dynamically adjusts to needs."
        ]
      },
      {
        "name": "Automated Testing & Quality Assurance",
        "levels": [
          "Testing is primarily manual, causing slow feedback loops.",
          "Some unit tests are automated, but coverage is limited.",
          "CI/CD pipelines integrate automated testing across environments.",
          "Security, performance, and compliance tests run automatically.",
          "AI-driven test automation predicts failures before they occur."
        ]
      },
      {
        "name": "Security Automation (DevSecOps)",
        "levels": [
          "Security reviews are performed manually at the end of development.",
          "Basic security scans are added to CI/CD pipelines.",
          "Automated security scanning ensures vulnerabilities are caught early.",
          "Real-time security analysis improves proactive risk mitigation.",
          "Threat detection is fully automated and AI-assisted."
        ]
      }
    ]
  },
  {
    "name": "Continuous Integration and Delivery (CI/CD)",
    "subDimensions": [
      {
        "name": "CI/CD Pipeline Maturity",
        "levels": [
          "Manual builds, deployments, and releases introduce inconsistencies.",
          "Some automation exists, but processes remain unreliable.",
          "CI/CD pipelines are fully automated with rollback mechanisms.",
          "Feature flags, blue-green, and canary releases improve safety.",
          "AI-driven autonomous deployments optimise release frequency."
        ]
      },
      {
        "name": "Trunk-Based Development & Feature Flags",
        "levels": [
          "Long-lived branches cause merge conflicts and slow integration.",
          "Developers merge more frequently, but conflicts still occur.",
          "Trunk-based development is widely adopted, reducing merge issues.",
          "Feature flags enable safe experimentation and controlled rollouts.",
          "All deployments are decoupled from releases for maximum flexibility."
        ]
      }
    ]
  },
  {
    "name": "Monitoring and Observability",
    "subDimensions": [
      {
        "name": "Logging & Telemetry",
        "levels": [
          "Minimal logging exists, making issue diagnosis difficult.",
          "Basic logs are captured but lack structure or centralisation.",
          "Logs are centralised with alerts for key system failures.",
          "Distributed tracing and anomaly detection improve insights.",
          "AI-driven monitoring proactively detects and resolves issues."
        ]
      },
      {
        "name": "Error Budgeting & Reliability Targets",
        "levels": [
          "No defined reliability targets, leading to inconsistent performance.",
          "Some reliability tracking, but no enforcement mechanisms exist.",
          "Error budgets are used to balance velocity with stability.",
          "SLIs and SLOs are defined and monitored for service reliability.",
          "Reliability targets are actively used to guide engineering decisions."
        ]
      }
    ]
  },
  {
    "name": "Infrastructure and Operations",
    "subDimensions": [
      {
        "name": "Cloud & Hybrid Infrastructure",
        "levels": [
          "Infrastructure is on-premises, with little automation.",
          "Cloud adoption begins, but legacy dependencies remain.",
          "Cloud-native services and containerisation improve scalability.",
          "Multi-cloud, service mesh, and hybrid strategies increase resilience.",
          "Fully serverless architecture with dynamic scaling optimises cost and performance."
        ]
      },
      {
        "name": "Capacity & Cost Optimisation",
        "levels": [
          "Capacity planning is manual and reactive.",
          "Basic cost tracking exists, but no proactive optimisations are in place.",
          "Automated scaling improves efficiency while reducing costs.",
          "Cost optimisation is integrated into CI/CD pipelines.",
          "AI-driven cost management ensures optimal resource allocation."
        ]
      }
    ]
  },
  {
    "name": "Security and Compliance",
    "subDimensions": [
      {
        "name": "Shift-Left Security & Secure SDLC",
        "levels": [
          "Security is checked manually at the end of development.",
          "Basic security tests are automated but reactive.",
          "Security is fully integrated into CI/CD pipelines.",
          "Proactive risk assessments and compliance-as-code prevent vulnerabilities.",
          "Security posture is continuously improved with AI-driven analytics."
        ]
      },
      {
        "name": "Secure Software Supply Chain",
        "levels": [
          "Third-party dependencies are manually managed with no security validation.",
          "Some automated dependency scanning is introduced.",
          "All dependencies are tracked and validated against security databases.",
          "End-to-end supply chain security ensures code integrity.",
          "Self-healing supply chain protections prevent compromises in real-time."
        ]
      }
    ]
  }
]
